#include <htc_board_info_and_setting.h>
#include <htc_reboot_info.h>
#include <htc_android_info.h>
#include <htc_version_info.h>
#include <htc_security_util.h>
#include <CFG_HTC_DATA_File.h>
#include <debug.h>
#include <sys/types.h>
#include <platform/partition.h>
#include <platform/boot_mode.h>
#include <dev/keys.h>
#include <bits.h>

//#include "ftm_lib_emmc_api.h"

#define CID_SIZE 8
#define IMEI_SIZE 15
#define MEID_SIZE 14
#define BOARD_INFO_MAGIC "HTC-BOARD-INFO!@"
#define BOARD_INFO_SIZE	1024
#define MAGIC_BOOT_2_KERNEL         0xAABBCCDD
#define CMDLINE_MAX_LEN	1024
//#define RESET_MSG_LENGTH 512

#define RESET_MSG_LENGTH HTC_REBOOT_INFO_REBOOT_STRING_SIZE

#define KERNEL_KMEMLEAK_FLAG  (BIT(4))
#define BOOTLOADER_CRYPTO_CHECK_FLAG (BIT(5))
#define BOOTLOADER_DISABLE_FORCE_DISK_ENCRYPTION  (BIT(19))

static const char* kernelflag_cmdline        = " kernelflag=0x";
static const char* debugflag_cmdline         = " debugflag=0x";
static const char* radioflag_cmdline         = " radioflag=0x";
static const char* radioflagex1_cmdline      = " radioflagex1=0x";
static const char* radioflagex2_cmdline      = " radioflagex2=0x";
static const char* device_hw_rev_cmdline     = " androidboot.devicerev=";
static const char* abnormal_reset_cmdline    = " abnrst=";
static const char *secure_level_cmdline      = " td.sf=";
static const char *atsdebug_cmdline          = " ro.atsdebug=";
static const char *getebd_cmdline            = " ro.getebd=";
extern int get_ebdlog;


static const char* bootloader_ver_cmdline    = " androidboot.bootloader=";

#ifdef MFG_BUILD
static const char *meta_auto_nvram_backup = " androidboot.meta.auto_nvram_backup=";
#endif

static const char* maxcpus_cmdline    = " maxcpus=";

#if TAMPER_DETECT
static const char *tpd_td_cmdline            = " td.td=";
static const char *tpd_ofs_cmdline           = " td.ofs=";
static const char *tpd_prd_cmdline           = " td.prd=";
static const char *tpd_dly_cmdline           = " td.dly=";
static const char *tpd_tmo_cmdline           = " td.tmo=";
#endif


HTC_BOARD_INFO* board_info = NULL;

//quote from hboot function chipset_setting_init
void htc_board_info_init()
{
		bool found = false;

		board_info = (HTC_BOARD_INFO *)memalign(4096, sizeof(HTC_BOARD_INFO));
		if(!board_info)
			goto err;

		memset(board_info, 0, sizeof(HTC_BOARD_INFO));

		partition_read("proinfo", HTC_BOARD_INFO_OFFSET, board_info, (board_info->end - board_info->start));

		if(strncmp(board_info->data.magic, BOARD_INFO_MAGIC, sizeof(board_info->data.magic))) {
			dprintf(CRITICAL, "%s: invalid board info\r\n", __func__);
			goto clear;
		}

		return;

	clear:
		memset(board_info, 0, sizeof(HTC_BOARD_INFO));
	err:
		dprintf(CRITICAL, "%s: fail to read board info\r\n", __func__);
	restore:
		memcpy(board_info->data.magic, BOARD_INFO_MAGIC, sizeof(board_info->data.magic));
		partition_write("proinfo", HTC_BOARD_INFO_OFFSET, board_info, (board_info->end - board_info->start));
}

int htc_get_pid()
{
	if(board_info == NULL) {
		dprintf(CRITICAL, "%s: board_info is NULL\r\n", __func__);
		return -1;
	} else {
		return board_info->data.pid;
	}
}

//from hboot include/utils.h
#define HEXSYMBOLCHK(c) (((c) >= '0' && (c) <= '9') ||\
                                                ((c) >= 'A' && (c) <= 'Z') ||\
                                                ((c) >= 'a' && (c) <= 'z') ||\
                                                ((c) == '-' || (c) == '_'))
//from hboot common/utils.c
static int invalid_cid(const char *cid)
{
	int i;
	if (cid == NULL)
		return -1;

	for (i = 0; i < CID_SIZE; i++) {
		if (HEXSYMBOLCHK(cid[i]))
			continue;
		else
			return -1;
	}

	/*must be NULL-terminated string*/
	if (!(cid[i] == NULL))
		return -1;

	return 0;
}

char *htc_chipset_get_cid(void)
{
	char cid[CID_SIZE + 1];

	if (!board_info || !board_info->data.cid)
		return NULL;

	memcpy(cid, board_info->data.cid, CID_SIZE);
	cid[CID_SIZE] = 0;

	if (cid[0] == 0x0 || cid[0] == 0xff || invalid_cid(cid)) {
		dprintf(CRITICAL, "fake cid: 11111111\r\n");
		return "11111111";
	}

	return board_info->data.cid;
}

//function in app/aboot/aboot.c
//extern uint32_t get_page_size();
uint32_t get_page_size() {
	//TODO:
	return 2048;
}

//===== from hboot incluce/setting.h =====
#define DEFAULT_SERIAL_NO "123456789012"
#define MISC_MAGIC "\x46\x4e\x4f\x43"
#define MAX_MFG_AWB_CAL_DATA_SIZE	(8 * 2048) /* Max 16384 bytes. */
#define BOOTLOADER_CONFIG_MAX 512

#define MAX_HEAP_TEST_PARAM_ARGC		8
#define MAX_HEAP_TEST_PARAM_ARGV_LEN		16
struct heap_test_param{
	int argc;
	char argv[MAX_HEAP_TEST_PARAM_ARGC][MAX_HEAP_TEST_PARAM_ARGV_LEN];
};

typedef struct {
    char command[32];
    char status[32];
    char recovery[768];
    char stage[32];
    char reserved[224];
} bootloader_message;

struct setting_data_2k_page{
	//misc partition
	//page 0
	char misc_page0_start[0];
	char backup_cid[16];			//0x000
	char auto_enter_bootloader[16];		//0x010
	char cold_boot[16];			//0x020
	char enter_updateloader[16];		//0x030
	char org_sdupdate_protect[16];		//0x040	(original hboot-kant ruu_nbh[])
	char radio_serial_debug[16];		//0x050
	char debug_cable[16];			//0x060
	char radio_usb_debug[16];		//0x070
	char not_use_0[16];			//0x080	(first 8 chars will be set to 0x0 by DIAG before SHIP)
	char org_autodownload[16];			//0x090 /* moved to PRO_INFO */
	char org_firmware_main_version[16];		//0x0A0 /* moved to PRO_INFO */
	char ruu_protect[16];			//0x0B0
	char hboot_preupdate[16];		//0x0C0
	char prefer_diag[16];			//0x0D0
	char logic_partition_update[16]; 	//0x0E0
	char special_ramdump[16];		//0x0F0
	char gift[16];				//0x100
	int offmode_alarm[10];			//0x110
	char vzw_hpst[16];			//0x138 (for vzw multiflash tool)
	char tamper_info[256];			//0x148 (for tamper detection)
	int offmode_alarm_snooze[10];		//0x248
	unsigned int reset_hw_reason;		//0x270

	char enable_log[68];			//0x274 (enable log in release ROM )
	char username[68];			//0x2B8 (for watermark)
	char reset_enable_log[8];		//0x2FC (for reset enable log in release ROM)

	unsigned int gift_files_count;		//0x304 (for gift function to the count of files copy)
	unsigned int gift_userdata_crc;		//0x308 (save the userdata crc before do gift function)
	char keycard_checked[8];		//0x30C (for checking keycard)
	char wipe_data_done[8];			//0x314 (factory reset done, for calibration tool in ASP)
	char rom_info_pre[8];			//0x31C (save previous rom information)
	char rom_info_cur[8];			//0x324 (save current rom information)
	char zip_info[32];			//0X32C (Add hidden information to EXE/Zip files)
	char heap_test[16];			//0x34C (heap test bottom half)
	struct heap_test_param ht_param; //0x35C
	char qsc_imei_update_result[16]; //0x3E0
	char qsc_version[16]; //0x3F0
	char temp_main_version[16];		//0x400
	char gdvoucher_redeemed[16];    //0x410
	int batt_magic_num;				//0x420
	int batt_soc; 					//0x424
	int batt_ocv_uv; 				//0x428
	int batt_cc_uah;				//0x42c
	unsigned long batt_stored_time;			//0x430
	unsigned int gift_files_size;       //0x434(for gift function to the size of files copy)
	int pre_delta_vddmax_mv;				//0x438
	unsigned int force_sec_boot_reason;
	char reserve0[2048-16*23-4*30-256-66-68-8-2-8*4-32-132-4-0x200];    //0x43C
	char reserved_for_htc_reboot_info[0x200];
	char misc_page0_end[0];
	//page 1
	char misc_page1_start[0];
	char command_old[32];
	char status_old[32];
	char recovery_old[1024];
	int ruu_first_boot;
	int gencheckpt_flag;
	int recovery_counter;
	char repartition_state[128];
	char reserve1[2048-1228];
	char misc_page1_end[0];
	//page 2
	char misc_page2_start[0];
	int org_cfgdata[BOOTLOADER_CONFIG_MAX]; /* moved to PRO_INFO */
	char misc_page2_end[0];
	// page 3
	char misc_page3_start[0];
	int reserve3[512];
	char misc_page3_end[0];
	// page 4
	char misc_page4_start[0];
	int AWB_cal_data[512];
	char misc_page4_end[0];
	// page 5
	char misc_page5_start[0];
	int reserve5[512];
	char misc_page5_end[0];
	// page 6
	char misc_page6_start[0];
	char imsi[16];	//USIM lock feature requested by SoftBank
	long timestamp;
	char reserve6[2048-16-4];
	char misc_page6_end[0];

	//internal
	char model_name[64];
